# Tips and Trick Python Pandas 44

# Menata ulang kolom Data Frame

# Import Module

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

# Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)

df

   A  B  C  D  E
0  3  6  9  8  6
1  3  8  8  3  5
2  6  8  6  5  3
3  7  2  2  7  1
4  2  7  3  7  9

# Menata ulang penempatan kolom pada Data Frame

Penempatan kolom sesuai yang diinginkan

In [5]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  8  9  3  6  6
1  3  8  3  5  8
2  5  6  6  3  8
3  7  2  7  1  2
4  7  3  2  9  7

In [6]:
df

   A  B  C  D  E
0  3  6  9  8  6
1  3  8  8  3  5
2  6  8  6  5  3
3  7  2  2  7  1
4  2  7  3  7  9

Penataan ulang kolom ditampung dalam sebuah variable

In [9]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  8  9  3  6  6
1  3  8  3  5  8
2  5  6  6  3  8
3  7  2  7  1  2
4  7  3  2  9  7